; domain
(define (domain hanoi)
	(:requirements :strips)
	(:types )
	(:constants )
	(:predicates
		(split )
		(unsplit )
		(g0_done___ )
		(g0_clear ?x)
		(g0_on ?x ?y)
		(g0_smaller ?x ?y)
	)
(:action do-split
	:parameters ()
	:precondition (and (unsplit ))
	:effect (and (not (unsplit )) (split ))
)
(:action mark-done-g0
	:parameters ()
	:precondition (and (split ) (g0_on d6 peg3) (g0_on d5 d6) (g0_on d4 d5) (g0_on d3 d4) (g0_on d2 d3) (g0_on d1 d2))
	:effect (and (g0_done___ ))
)
(:action gGLOBAL_move
	:parameters (?disc ?from ?to)
	:precondition (and (unsplit ) (g0_smaller ?to ?disc) (g0_on ?disc ?from) (g0_clear ?disc) (g0_clear ?to))
	:effect (and (g0_clear ?from) (g0_on ?disc ?to) (not (g0_on ?disc ?from)) (not (g0_clear ?to)) (increase (total-cost ) 1))
)
(:action g0_move
	:parameters (?disc ?from ?to)
	:precondition (and (g0_smaller ?to ?disc) (g0_on ?disc ?from) (g0_clear ?disc) (g0_clear ?to) (split ))
	:effect (and (g0_clear ?from) (g0_on ?disc ?to) (not (g0_on ?disc ?from)) (not (g0_clear ?to)))
)
)

; problem
(define (problem hanoi-6)
	(:domain hanoi)
	(:objects peg1 peg2 peg3 d1 d2 d3 d4 d5 d6)
	(:init 
		(unsplit )
		(g0_smaller peg1 d1)
		(g0_smaller peg1 d2)
		(g0_smaller peg1 d3)
		(g0_smaller peg1 d4)
		(g0_smaller peg1 d5)
		(g0_smaller peg1 d6)
		(g0_smaller peg2 d1)
		(g0_smaller peg2 d2)
		(g0_smaller peg2 d3)
		(g0_smaller peg2 d4)
		(g0_smaller peg2 d5)
		(g0_smaller peg2 d6)
		(g0_smaller peg3 d1)
		(g0_smaller peg3 d2)
		(g0_smaller peg3 d3)
		(g0_smaller peg3 d4)
		(g0_smaller peg3 d5)
		(g0_smaller peg3 d6)
		(g0_smaller d1 d1)
		(g0_smaller d2 d1)
		(g0_smaller d3 d1)
		(g0_smaller d4 d1)
		(g0_smaller d5 d1)
		(g0_smaller d6 d1)
		(g0_smaller d2 d2)
		(g0_smaller d3 d2)
		(g0_smaller d4 d2)
		(g0_smaller d5 d2)
		(g0_smaller d6 d2)
		(g0_smaller d3 d3)
		(g0_smaller d4 d3)
		(g0_smaller d5 d3)
		(g0_smaller d6 d3)
		(g0_smaller d4 d4)
		(g0_smaller d5 d4)
		(g0_smaller d6 d4)
		(g0_smaller d5 d5)
		(g0_smaller d6 d5)
		(g0_clear peg2)
		(g0_clear peg3)
		(g0_clear d1)
		(g0_on d6 peg1)
		(g0_on d5 d6)
		(g0_on d4 d5)
		(g0_on d3 d4)
		(g0_on d2 d3)
		(g0_on d1 d2)
	)
	(:goal (and (g0_on d6 peg3) (g0_on d5 d6) (g0_on d4 d5) (g0_on d3 d4) (g0_on d2 d3) (g0_on d1 d2)))
)

; plan
1. (gglobal_move d1 d2 peg2)
   deleted: (g0_on d1 d2) (g0_clear peg2)
   added: (g0_clear d2) (g0_on d1 peg2)
   goals met: 4 of 6
2. (gglobal_move d2 d3 peg3)
   deleted: (g0_on d2 d3) (g0_clear peg3)
   added: (g0_clear d3) (g0_on d2 peg3)
   goals met: 3 of 6
3. (gglobal_move d1 peg2 d2)
   deleted: (g0_on d1 peg2) (g0_clear d2)
   added: (g0_clear peg2) (g0_on d1 d2)
   goals met: 4 of 6
4. (gglobal_move d3 d4 peg2)
   deleted: (g0_on d3 d4) (g0_clear peg2)
   added: (g0_clear d4) (g0_on d3 peg2)
   goals met: 3 of 6
5. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 2 of 6
6. (gglobal_move d2 peg3 d3)
   deleted: (g0_on d2 peg3) (g0_clear d3)
   added: (g0_clear peg3) (g0_on d2 d3)
   goals met: 3 of 6
7. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 4 of 6
8. (gglobal_move d4 d5 peg3)
   deleted: (g0_on d4 d5) (g0_clear peg3)
   added: (g0_clear d5) (g0_on d4 peg3)
   goals met: 3 of 6
9. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 2 of 6
10. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 1 of 6
11. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 2 of 6
12. (gglobal_move d3 peg2 d4)
   deleted: (g0_on d3 peg2) (g0_clear d4)
   added: (g0_clear peg2) (g0_on d3 d4)
   goals met: 3 of 6
13. (gglobal_move d1 d2 peg2)
   deleted: (g0_on d1 d2) (g0_clear peg2)
   added: (g0_clear d2) (g0_on d1 peg2)
   goals met: 2 of 6
14. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 3 of 6
15. (gglobal_move d1 peg2 d2)
   deleted: (g0_on d1 peg2) (g0_clear d2)
   added: (g0_clear peg2) (g0_on d1 d2)
   goals met: 4 of 6
16. (gglobal_move d5 d6 peg2)
   deleted: (g0_on d5 d6) (g0_clear peg2)
   added: (g0_clear d6) (g0_on d5 peg2)
   goals met: 3 of 6
17. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 2 of 6
18. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 1 of 6
19. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 2 of 6
20. (gglobal_move d3 d4 d6)
   deleted: (g0_on d3 d4) (g0_clear d6)
   added: (g0_clear d4) (g0_on d3 d6)
   goals met: 1 of 6
21. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 0 of 6
22. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 1 of 6
23. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 2 of 6
24. (gglobal_move d4 peg3 d5)
   deleted: (g0_on d4 peg3) (g0_clear d5)
   added: (g0_clear peg3) (g0_on d4 d5)
   goals met: 3 of 6
25. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 2 of 6
26. (gglobal_move d2 d3 peg3)
   deleted: (g0_on d2 d3) (g0_clear peg3)
   added: (g0_clear d3) (g0_on d2 peg3)
   goals met: 1 of 6
27. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 2 of 6
28. (gglobal_move d3 d6 d4)
   deleted: (g0_on d3 d6) (g0_clear d4)
   added: (g0_clear d6) (g0_on d3 d4)
   goals met: 3 of 6
29. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 2 of 6
30. (gglobal_move d2 peg3 d3)
   deleted: (g0_on d2 peg3) (g0_clear d3)
   added: (g0_clear peg3) (g0_on d2 d3)
   goals met: 3 of 6
31. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 4 of 6
32. (gglobal_move d6 peg1 peg3)
   deleted: (g0_on d6 peg1) (g0_clear peg3)
   added: (g0_clear peg1) (g0_on d6 peg3)
   goals met: 5 of 6
33. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 4 of 6
34. (gglobal_move d2 d3 peg1)
   deleted: (g0_on d2 d3) (g0_clear peg1)
   added: (g0_clear d3) (g0_on d2 peg1)
   goals met: 3 of 6
35. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 4 of 6
36. (gglobal_move d3 d4 d6)
   deleted: (g0_on d3 d4) (g0_clear d6)
   added: (g0_clear d4) (g0_on d3 d6)
   goals met: 3 of 6
37. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 2 of 6
38. (gglobal_move d2 peg1 d3)
   deleted: (g0_on d2 peg1) (g0_clear d3)
   added: (g0_clear peg1) (g0_on d2 d3)
   goals met: 3 of 6
39. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 4 of 6
40. (gglobal_move d4 d5 peg1)
   deleted: (g0_on d4 d5) (g0_clear peg1)
   added: (g0_clear d5) (g0_on d4 peg1)
   goals met: 3 of 6
41. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 2 of 6
42. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 1 of 6
43. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 2 of 6
44. (gglobal_move d3 d6 d4)
   deleted: (g0_on d3 d6) (g0_clear d4)
   added: (g0_clear d6) (g0_on d3 d4)
   goals met: 3 of 6
45. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 2 of 6
46. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 3 of 6
47. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 4 of 6
48. (gglobal_move d5 peg2 d6)
   deleted: (g0_on d5 peg2) (g0_clear d6)
   added: (g0_clear peg2) (g0_on d5 d6)
   goals met: 5 of 6
49. (gglobal_move d1 d2 peg2)
   deleted: (g0_on d1 d2) (g0_clear peg2)
   added: (g0_clear d2) (g0_on d1 peg2)
   goals met: 4 of 6
50. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 3 of 6
51. (gglobal_move d1 peg2 d2)
   deleted: (g0_on d1 peg2) (g0_clear d2)
   added: (g0_clear peg2) (g0_on d1 d2)
   goals met: 4 of 6
52. (gglobal_move d3 d4 peg2)
   deleted: (g0_on d3 d4) (g0_clear peg2)
   added: (g0_clear d4) (g0_on d3 peg2)
   goals met: 3 of 6
53. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 2 of 6
54. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 3 of 6
55. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 4 of 6
56. (gglobal_move d4 peg1 d5)
   deleted: (g0_on d4 peg1) (g0_clear d5)
   added: (g0_clear peg1) (g0_on d4 d5)
   goals met: 5 of 6
57. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 4 of 6
58. (gglobal_move d2 d3 peg1)
   deleted: (g0_on d2 d3) (g0_clear peg1)
   added: (g0_clear d3) (g0_on d2 peg1)
   goals met: 3 of 6
59. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 4 of 6
60. (gglobal_move d3 peg2 d4)
   deleted: (g0_on d3 peg2) (g0_clear d4)
   added: (g0_clear peg2) (g0_on d3 d4)
   goals met: 5 of 6
61. (gglobal_move d1 d2 peg2)
   deleted: (g0_on d1 d2) (g0_clear peg2)
   added: (g0_clear d2) (g0_on d1 peg2)
   goals met: 4 of 6
62. (gglobal_move d2 peg1 d3)
   deleted: (g0_on d2 peg1) (g0_clear d3)
   added: (g0_clear peg1) (g0_on d2 d3)
   goals met: 5 of 6
63. (gglobal_move d1 peg2 d2)
   deleted: (g0_on d1 peg2) (g0_clear d2)
   added: (g0_clear peg2) (g0_on d1 d2)
   goals met: 6 of 6
